Revit 2026 API

# DocumentGetSubelement(String) Method

---

Gets the subelement referenced by a unique id string.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Subelement GetSubelement(
	string uniqueId
)
```
```vb
Public Function GetSubelement (
	uniqueId As String
) As Subelement
```
```cpp
public:
Subelement^ GetSubelement(
	String^ uniqueId
)
```
```fsharp
member GetSubelement :
        uniqueId : string -> Subelement
```

#### Parameters

uniqueId String
     The unique id that identifies element or subelement.
* UniqueId

#### Return Value

Subelement The subelement referenced by the input argument.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

will be returned if the input id string doesn't reference to a valid element or subelement.

#### Reference

Document Class

GetSubelement Overload

Autodesk.Revit.DB Namespace